import React from 'react';
import { Container, Card } from 'react-bootstrap';

const PresentlyDescription: React.FC = () => {
  return (
    <Container className="d-flex justify-content-center align-items-center vh-100">
      <Card style={{ maxWidth: '600px' }} className="p-4 shadow-sm">
        <Card.Body>
          <Card.Title className="text-center">
            <strong>Presently</strong> – платформа для втілення ваших бажань і створення незабутніх подарунків!
          </Card.Title>
          <Card.Text>
            Проблема вибору подарунка вже не буде головним болем завдяки <strong>Presently</strong>. Наша платформа дозволяє кожному користувачу створити особистий профіль, де можна публікувати власні «бажання» – список речей, які ви хотіли б отримати на свято. Друзі та рідні зможуть знайти ваш профіль, переглянути список ваших побажань і навіть забронювати те, що вони планують подарувати.
          </Card.Text>
          <Card.Text>
            <strong>Зручності, які пропонує Presently:</strong>
          </Card.Text>
          <ul style={{textAlign: 'left'}}>
            <li>Індивідуальний профіль: створіть список своїх бажань, додавайте до них опис, фото та посилання на ресурси для покупок.</li>
            <li>Анонімність сюрпризу: ніхто не дізнається, хто саме обрав ваш подарунок, зберігаючи елемент несподіванки.</li>
            <li>Зручний пошук: знайдіть профіль друга чи родича та оберіть подарунок, який принесе справжнє задоволення.</li>
            <li>Уникнення повторів: коли хтось «забирає» побажання, воно позначається як заброньоване, і таким чином ніхто інший не подарує його вдруге.</li>
          </ul>
          <Card.Text>
            <strong>Як це працює?</strong>
          </Card.Text>
          <ol style={{textAlign: 'left'}}>
            <li>Створіть профіль та додайте свої побажання.</li>
            <li>Переглядайте побажання друзів або родичів.</li>
            <li>Обирайте і бронюйте подарунки, щоб ніхто інший не обрав те саме.</li>
            <li>Зберігайте елемент сюрпризу: особа, якій призначений подарунок, ніколи не знатиме наперед, хто саме його підготував.</li>
          </ol>
          <Card.Text className="text-center">
            З <strong>Presently</strong> ваші подарунки завжди будуть влучними та приємно несподіваними!
          </Card.Text>
        </Card.Body>
      </Card>
    </Container>
  );
};

export default PresentlyDescription;
